Revit 2024 API
MemberForcesServiceData Class
 The data needed by member forces server to perform type definition.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public class MemberForcesServiceData : IDisposable
Visual Basic
Public Class MemberForcesServiceData _
	Implements IDisposable
Visual C++
public ref class MemberForcesServiceData : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.MemberForcesServiceData
See Also
MemberForcesServiceData Members
Autodesk.Revit.DB.Structure Namespace